Repository: xuancanhit99/hyper_split_bill
Catalog: lib/l10n/app_*.arb
Languages: ru, vi

# billEditPageEditTitle
source: Edit Bill
ru: Редактировать счет
vi: Chỉnh sửa hóa đơn

# billEditPageReviewTitle
source: Review Bill
ru: Просмотр счета
vi: Xem lại hóa đơn

# billEditPageSaveTooltip
source: Save Bill Data
ru: Сохранить данные счета
vi: Lưu dữ liệu hóa đơn

# billEditPageEditTooltip
source: Edit Bill Data
ru: Редактировать данные счета
vi: Chỉnh sửa dữ liệu hóa đơn

# billEditPageResultButtonLabel
source: Result
ru: Результат
vi: Kết quả

# billEditPageEditButtonLabel
source: Edit Bill
ru: Редактировать счет
vi: Sửa hoá đơn

# billEditPageParticipantsSectionTitle
source: Participants:
ru: Участники:
vi: Người tham gia:

# billEditPageSplitEquallyButtonLabel
source: Split Equally Among {count}
ru: Разделить поровну между {count}
vi: Chia đều cho {count}

# billEditPageFinalJsonTileTitle
source: Final Bill JSON Data
ru: Итоговые данные счета (JSON)
vi: Dữ liệu hóa đơn cuối cùng (JSON)

# billEditPageAskBillBotButtonLabel
source: Ask Bill Bot
ru: Спросить Билл Бота
vi: Hỏi Bill Bot

# billEditPageRawJsonTileTitle
source: Raw OCR/JSON Data (Initial)
ru: Исходные данные OCR/JSON
vi: Dữ liệu OCR/JSON thô (Ban đầu)

# billEditPageErrorParsingOcr
source: Error parsing OCR data: {error}
ru: Ошибка разбора данных OCR: {error}
vi: Lỗi phân tích dữ liệu OCR: {error}

# billEditPageSaveErrorSnackbar
source: Save Error: {message}
ru: Ошибка сохранения: {message}
vi: Lỗi lưu: {message}

# billEditPageValidationErrorTotalAmount
source: Please enter a valid total amount.
ru: Пожалуйста, введите действительную общую сумму.
vi: Vui lòng nhập tổng số tiền hợp lệ.

# billEditPageValidationErrorPercentages
source: Participant percentages must add up to 100%. Current total: {totalPercentage}%
ru: Проценты участников должны в сумме составлять 100%. Текущая сумма: {totalPercentage}%
vi: Tổng phần trăm người tham gia phải là 100%. Tổng hiện tại: {totalPercentage}%

# billEditPageValidationErrorDate
source: Please enter a valid date (dd-MM-yyyy).
ru: Пожалуйста, введите действительную дату (дд-ММ-гггг).
vi: Vui lòng nhập ngày hợp lệ (dd-MM-yyyy).

# billEditPageValidationErrorCurrency
source: Invalid currency selected. Please choose from the list.
ru: Выбрана недействительная валюта. Пожалуйста, выберите из списка.
vi: Đã chọn tiền tệ không hợp lệ. Vui lòng chọn từ danh sách.

# billEditPageValidationErrorAuth
source: Error: User not authenticated.
ru: Ошибка: Пользователь не аутентифицирован.
vi: Lỗi: Người dùng chưa được xác thực.

# billEditPageDefaultItemDescription
source: Unknown Item
ru: Неизвестный товар
vi: Mục không xác định

# billEditPageDefaultParticipantName
source: Me
ru: Я
vi: Tôi

# billEditPageErrorParsingJson
source: Failed to parse structured data: {error}
ru: Не удалось разобрать структурированные данные: {error}
vi: Không thể phân tích dữ liệu cấu trúc: {error}

# billEditPageErrorUnassignedItems
source: {count,plural, =1{1 item ('{firstItemName}') is not assigned to any participant. Please assign all items.} other{{count} items are not assigned to any participant, starting with '{firstItemName}'. Please assign all items.}}
ru: {count,plural, =1{1 позиция ('{firstItemName}') не назначена ни одному участнику. Пожалуйста, назначьте все позиции.} other{{count} позиций не назначены ни одному участнику, начиная с '{firstItemName}'. Пожалуйста, назначьте все позиции.}}
vi: {count,plural, =1{1 mục ('{firstItemName}') chưa được gán cho người tham gia nào. Vui lòng gán tất cả các mục.} other{{count} mục chưa được gán cho người tham gia nào, bắt đầu với '{firstItemName}'. Vui lòng gán tất cả các mục.}}

# billEditPageErrorNoParticipants
source: Please add at least one participant to the bill.
ru: Пожалуйста, добавьте хотя бы одного участника к счету.
vi: Vui lòng thêm ít nhất một người tham gia vào hóa đơn.

# billEditPageWarningUnallocatedCost
source: Warning: Some costs may not have been allocated. Total owed: {totalOwed}, Bill total: {billTotal}.
ru: Внимание: Некоторые расходы могли быть не распределены между участниками. Общая сумма к оплате: {totalOwed}, Общая сумма счета: {billTotal}.
vi: Cảnh báo: Một số chi phí có thể chưa được phân bổ cho người tham gia. Tổng nợ: {totalOwed}, Tổng hóa đơn: {billTotal}.

# totalMismatchWarning
source: Warning: The sum of item totals ({itemsTotal}) does not match the bill's subtotal ({subtotal}). Please review item prices or the subtotal.
vi: Cảnh báo: Tổng tiền các mục ({itemsTotal}) không khớp với tổng phụ của hóa đơn ({subtotal}). Vui lòng xem lại giá các mục hoặc tổng phụ.

# dialogEditDescriptionTitle
source: Edit Description
ru: Редактировать описание
vi: Chỉnh sửa mô tả

# dialogEditTotalAmountTitle
source: Edit Total Amount
ru: Редактировать общую сумму
vi: Chỉnh sửa tổng số tiền

# dialogEditTaxTitle
source: Edit Tax
ru: Редактировать налог
vi: Chỉnh sửa thuế

# dialogEditTipTitle
source: Edit Tip
ru: Редактировать чаевые
vi: Chỉnh sửa tiền boa

# dialogEditDiscountTitle
source: Edit Discount
ru: Редактировать скидку
vi: Chỉnh sửa giảm giá

# dialogAddOptionalFieldsTitle
source: Add Optional Fields
ru: Добавить необязательные поля
vi: Thêm các trường tùy chọn

# checkboxTaxLabel
source: Tax
ru: Налог
vi: Thuế

# checkboxTipLabel
source: Tip
ru: Чаевые
vi: Tiền boa

# checkboxDiscountLabel
source: Discount
ru: Скидка
vi: Giảm giá

# checkboxCurrencyLabel
source: Currency
ru: Валюта
vi: Tiền tệ

# buttonCancel
source: Cancel
ru: Отмена
vi: Hủy

# buttonSave
source: Save
ru: Сохранить
vi: Lưu

# buttonDone
source: Done
ru: Готово
vi: Hoàn thành

# editBillInfoSectionUpdateTotalButtonLabel
source: Update Total
ru: Обновить сумму
vi: Cập nhật tổng

# participantSectionInvalidPercentageLock
source: Please enter a valid percentage (0-100) before locking.
ru: Пожалуйста, введите действительный процент (0-100) перед блокировкой.
vi: Vui lòng nhập phần trăm hợp lệ (0-100) trước khi khóa.

# participantSectionAddDialogTitle
source: Add Participant
ru: Добавить участника
vi: Thêm người tham gia

# participantSectionAddDialogHint
source: Enter participant name
ru: Введите имя участника
vi: Nhập tên người tham gia

# participantSectionAddDialogButton
source: Add
ru: Добавить
vi: Thêm

# participantSectionExistsSnackbar
source: Participant "{name}" already exists.
ru: Участник "{name}" уже существует.
vi: Người tham gia "{name}" đã tồn tại.

# participantSectionCannotRemoveLastSnackbar
source: Cannot remove the last participant.
ru: Нельзя удалить последнего участника.
vi: Không thể xóa người tham gia cuối cùng.

# participantSectionHeaderName
source: Name
ru: Имя
vi: Tên

# participantSectionHeaderPercent
source: Percent
ru: Процент
vi: Phần trăm

# participantSectionHeaderAmount
source: Amount
ru: Сумма
vi: Số tiền

# participantSectionEmptyListEdit
source: No participants added yet.
ru: Участники еще не добавлены.
vi: Chưa có người tham gia nào được thêm.

# participantSectionEmptyListReview
source: No participants.
ru: Нет участников.
vi: Không có người tham gia.

# participantSectionAddButtonLabel
source: Add Participant
ru: Добавить участника
vi: Thêm người tham gia

# participantSectionRemoveTooltip
source: Remove {name}
ru: Удалить {name}
vi: Xóa {name}

# itemDialogValidationDescriptionEmpty
source: Description cannot be empty.
ru: Описание не может быть пустым.
vi: Mô tả không được để trống.

# billItemWidgetNoParticipantSelected
source: No participant selected
ru: Участник не выбран
vi: Chưa chọn người tham gia

# itemDialogValidationQuantityNegative
source: Quantity must be a non-negative number.
ru: Количество должно быть неотрицательным числом.
vi: Số lượng phải là số không âm.

# editDialogContentEnterDescriptionHint
source: Enter description or store name
ru: Введите описание или название магазина
vi: Nhập mô tả hoặc tên cửa hàng

# editDialogContentEnterValueHint
source: Enter value
ru: Введите значение
vi: Nhập giá trị

# editDialogContentInvalidNumberError
source: Please enter a valid number
ru: Пожалуйста, введите действительное число
vi: Vui lòng nhập số hợp lệ

# itemDialogValidationPriceNegative
source: Prices cannot be negative.
ru: Цены не могут быть отрицательными.
vi: Giá không được âm.

# editableRowTapToEdit
source: Tap to edit {label}
ru: Нажмите для редактирования {label}
vi: Nhấn để chỉnh sửa {label}

# itemDialogValidationConfirmTwo
source: Please confirm exactly two values (Quantity, Unit Price, or Total Price) using the checkboxes.
ru: Пожалуйста, подтвердите ровно два значения (Количество, Цена за единицу или Общая цена) с помощью флажков.
vi: Vui lòng xác nhận chính xác hai giá trị (Số lượng, Đơn giá hoặc Tổng giá) bằng cách sử dụng hộp kiểm.

# itemDialogValidationInconsistent
source: Error: Final values are inconsistent (Qty * Unit Price != Total Price). Please re-confirm.
ru: Ошибка: Итоговые значения несовместимы (Кол-во * Цена за ед. != Общая цена). Пожалуйста, подтвердите заново.
vi: Lỗi: Các giá trị cuối cùng không nhất quán (Số lượng * Đơn giá != Tổng giá). Vui lòng xác nhận lại.

# itemDialogDescriptionLabel
source: Description
ru: Описание
vi: Mô tả

# itemDialogQuantityLabel
source: Quantity
ru: Кол-во
vi: Số lượng

# itemDialogUnitPriceLabel
source: Unit Price
ru: Цена за ед.
vi: Đơn giá

# itemDialogTotalPriceLabel
source: Total Price
ru: Общая цена
vi: Tổng giá

# itemSectionDeletedSnackbar
source: Item deleted
ru: Позиция удалена
vi: Đã xóa mục

# itemSectionEmptyList
source: No items added yet.
ru: Позиции еще не добавлены.
vi: Chưa có mục nào được thêm.

# itemSectionConfirmDeleteDialogTitle
source: Confirm Delete
ru: Подтвердить удаление
vi: Xác nhận xóa

# itemSectionConfirmDeleteDialogContent
source: Are you sure you want to delete "{description}"?
ru: Вы уверены, что хотите удалить "{description}"?
vi: Bạn có chắc chắn muốn xóa "{description}"?

# itemSectionConfirmDeleteDialogFallbackItemName
source: this item
ru: эту позицию
vi: mục này

# itemSectionDeleteButton
source: Delete
ru: Удалить
vi: Xóa

# itemSectionAddButtonLabel
source: Add Item
ru: Добавить позицию
vi: Thêm mục

# itemSectionHeaderDescription
source: Description
ru: Описание
vi: Mô tả

# itemSectionHeaderQty
source: Qty
ru: Кол-во
vi: SL

# itemSectionHeaderUnitPrice
source: Unit Price
ru: Цена за ед.
vi: Đơn giá

# itemSectionHeaderTotalPrice
source: Total Price
ru: Общая цена
vi: Tổng giá

# itemDialogAddTitle
source: Add New Item
ru: Добавить новую позицию
vi: Thêm mục mới

# itemDialogEditTitle
source: Edit Item
ru: Редактировать позицию
vi: Chỉnh sửa mục

# imageCropPageTitle
source: Crop Bill Image
ru: Обрезать изображение счета
vi: Cắt ảnh hóa đơn

# imageCropPageErrorSnackbar
source: Error cropping image: {error}
ru: Ошибка обрезки изображения: {error}
vi: Lỗi cắt ảnh: {error}

# chatbotPageTitle
source: Bill Bot Assistant
ru: Билл Бот Помощник
vi: Trợ lý Bill Bot

# chatbotPageAnalyzingMessage
source: Analyzing bill and preparing suggestions...
ru: Анализирую счет и готовлю предложения...
vi: Đang phân tích hóa đơn và chuẩn bị gợi ý...

# chatbotPageErrorStartingChat
source: Sorry, I had trouble starting the chat: {error}
ru: Извините, не удалось начать чат: {error}
vi: Xin lỗi, tôi gặp sự cố khi bắt đầu trò chuyện: {error}

# chatbotPageErrorSendingMessage
source: Sorry, I encountered an error: {error}
ru: Извините, произошла ошибка: {error}
vi: Xin lỗi, tôi gặp lỗi: {error}

# chatbotPageSuggestionTooltip
source: Send "{suggestion}"
ru: Отправить "{suggestion}"
vi: Gửi "{suggestion}"

# chatbotPageInputHint
source: Ask how to split the bill...
ru: Спросите, как разделить счет...
vi: Hỏi cách chia hóa đơn...

# chatbotPageSendButtonTooltip
source: Send message
ru: Отправить сообщение
vi: Gửi tin nhắn

# billUploadPageTitle
source: Upload Bill
ru: Загрузить счет
vi: Tải hóa đơn lên

# billUploadPageNoImageToRetrySnackbar
source: No image available to retry OCR.
ru: Нет изображения для повторного OCR.
vi: Không có hình ảnh để thử lại OCR.

# billUploadPageOcrFailedSnackbar
source: OCR Failed: {message}
ru: Ошибка OCR: {message}
vi: OCR thất bại: {message}

# billUploadPageProcessingErrorDefault
source: Could not process the image. Please try again.
ru: Не удалось обработать изображение. Пожалуйста, попробуйте еще раз.
vi: Không thể xử lý hình ảnh. Vui lòng thử lại.

# billUploadPageNotAReceiptError
source: ðŸ¤– This image does not appear to be a receipt/bill/invoice. Please upload a valid document.
ru: 🤖 Это изображение не похоже на чек/счет/инвойс. Пожалуйста, загрузите действительный документ.
vi: 🤖 Hình ảnh này không giống hóa đơn/biên lai/hóa đơn. Vui lòng tải lên một tài liệu hợp lệ.

# billUploadPageNotAReceiptButCategoryError
source: ðŸ¤– This image does not appear to be a receipt/bill/invoice. It looks like a '{category}'. Please upload a valid document.
ru: 🤖 Это изображение не похоже на чек/счет/инвойс. Похоже, это '{category}'. Пожалуйста, загрузите действительный документ.
vi: 🤖 Hình ảnh này không giống hóa đơn/biên lai/hóa đơn. Nó giống như một '{category}'. Vui lòng tải lên một tài liệu hợp lệ.

# billUploadPageUnknownCategory
source: unknown
ru: неизвестно
vi: không xác định

# billUploadPageCannotDetermineReceiptError
source: Could not determine if the image is a receipt. Please try again.
ru: Не удалось определить, является ли изображение чеком. Пожалуйста, попробуйте еще раз.
vi: Không thể xác định xem hình ảnh có phải là hóa đơn hay không. Vui lòng thử lại.

# billUploadPageJsonProcessingError
source: Failed to process the structured data.
ru: Не удалось обработать структурированные данные.
vi: Không thể xử lý dữ liệu cấu trúc.

# billUploadPageOcrSuccessSnackbar
source: Receipt detected! Navigating to edit...
ru: Чек распознан! Переход к редактированию...
vi: Đã phát hiện hóa đơn! Đang chuyển đến chỉnh sửa...

# billUploadPagePlaceholder
source: Select an image or take a photo of your bill.
ru: Выберите изображение или сфотографируйте ваш счет.
vi: Chọn hình ảnh hoặc chụp ảnh hóa đơn của bạn.

# billUploadPageRetryOcrButtonLabel
source: Retry OCR
ru: Повторить OCR
vi: Thử lại OCR

# billUploadPageGalleryButtonLabel
source: Choose from Gallery
ru: Выбрать из галереи
vi: Chọn từ Thư viện

# billUploadPageCameraButtonLabel
source: Take Photo
ru: Сделать фото
vi: Chụp ảnh

# billUploadPageLoadingStructuring
source: Structuring data...
ru: Структурирование данных...
vi: Đang cấu trúc dữ liệu...

# billUploadPageLoadingProcessing
source: Processing image...
ru: Обработка изображения...
vi: Đang xử lý hình ảnh...

# billUploadPageLogNoImageSelected
source: No image selected.
ru: Изображение не выбрано.
vi: Chưa chọn hình ảnh.

# billUploadPageLogCroppingCancelled
source: Cropping cancelled or failed.
ru: Кадрирование отменено или не удалось.
vi: Hủy hoặc cắt ảnh thất bại.

# billUploadPageLogNoImageTaken
source: No image taken.
ru: Изображение не сделано.
vi: Chưa chụp hình ảnh.

# billUploadPageLogRetryNoImage
source: Retry OCR called but no image is selected.
ru: Повторный OCR вызван, но изображение не выбрано.
vi: Gọi thử lại OCR nhưng chưa chọn hình ảnh.

# billUploadPageCropCancelledSnackbar
source: Cropping cancelled or failed.
vi: Đã hủy hoặc cắt ảnh thất bại.

# settingsPageTitle
source: Settings
ru: Настройки
vi: Cài đặt

# settingsPageLanguageLabel
source: Language
ru: Язык
vi: Ngôn ngữ

# settingsPageCurrentLanguage
source: Current language
ru: Текущий язык
vi: Ngôn ngữ hiện tại

# settingsPageSelectLanguageTitle
source: Select Language
ru: Выберите язык
vi: Chọn ngôn ngữ

# languageEnglish
source: English
ru: Английский
vi: Tiếng Anh

# languageRussian
source: Russian
ru: Русский
vi: Tiếng Nga

# languageVietnamese
source: Vietnamese
ru: Вьетнамский
vi: Tiếng Việt

# settingsPageOcrServiceLabel
source: OCR Service
ru: Сервис OCR
vi: Dịch vụ OCR

# settingsPageChatServiceLabel
source: Chat Service
ru: Сервис чата
vi: Dịch vụ Chat

# homePageTitle
source: Home Page
ru: Главная страница
vi: Trang chủ

# homePageSettingsTooltip
source: Settings
ru: Настройки
vi: Cài đặt

# homePageSignOutTooltip
source: Sign Out
ru: Выйти
vi: Đăng xuất

# homePageToggleThemeTooltip
source: Toggle Theme
ru: Переключить тему
vi: Chuyển đổi giao diện

# homePageSignOutDialogTitle
source: Confirm Sign Out
ru: Подтвердите выход
vi: Xác nhận đăng xuất

# homePageSignOutDialogContent
source: Are you sure you want to sign out?
ru: Вы уверены, что хотите выйти?
vi: Bạn có chắc chắn muốn đăng xuất không?

# homePageSignOutDialogConfirmButton
source: Sign Out
ru: Выйти
vi: Đăng xuất

# homePageWelcomeDefault
source: Welcome!
ru: Добро пожаловать!
vi: Chào mừng!

# homePageWelcomeUser
source: Welcome, {userEmail}!
ru: Добро пожаловать, {userEmail}!
vi: Chào mừng, {userEmail}!

# homePageSplitNewBillButton
source: Split a New Bill
ru: Разделить новый счет
vi: Chia hóa đơn mới

# homePageViewHistoryButton
source: View Bill History
ru: Просмотреть историю счетов
vi: Xem lịch sử hóa đơn

# authPageErrorOccurred
source: An error occurred: {message}
ru: Произошла ошибка: {message}
vi: Đã xảy ra lỗi: {message}

# authPagePasswordResetEmailSent
source: Password recovery email sent! Check your inbox.
ru: Письмо для сброса пароля отправлено! Проверьте ваш почтовый ящик.
vi: Đã gửi email khôi phục mật khẩu! Kiểm tra hộp thư đến của bạn.

# authPageHeaderTitle
source: Welcome Back!
ru: С возвращением!
vi: Chào mừng trở lại!

# authPageHeaderSubtitle
source: Sign in or create an account to get started.
ru: Войдите или создайте аккаунт, чтобы начать.
vi: Đăng nhập hoặc tạo tài khoản để bắt đầu.

# authPageSignUpSuccess
source: Sign Up successful! Check your email for verification.
ru: Регистрация успешна! Проверьте вашу почту для верификации.
vi: Đăng ký thành công! Kiểm tra email của bạn để xác minh.

# authPageUnexpectedError
source: An unexpected error occurred.
ru: Произошла непредвиденная ошибка.
vi: Đã xảy ra lỗi không mong đợi.

# authPageTermsLink
source: Terms
ru: Условия
vi: Điều khoản

# authPagePrivacyLink
source: Privacy
ru: Конфиденциальность
vi: Bảo mật

# editBillInfoSectionTotalAmountPrefix
source: Total Amount
ru: Общая сумма
vi: Tổng số tiền

# editBillInfoSectionTotalAmountLabel
source: Total Amount
ru: Общая сумма
vi: Tổng số tiền

# editBillInfoSectionDescriptionLabel
source: Description / Store
ru: Описание / Магазин
vi: Mô tả / Cửa hàng

# editBillInfoSectionDateLabel
source: Date
ru: Дата
vi: Ngày

# editBillInfoSectionTaxLabel
source: Tax
ru: Налог
vi: Thuế

# editBillInfoSectionTipLabel
source: Tip
ru: Чаевые
vi: Tiền boa

# editBillInfoSectionDiscountLabel
source: Discount
ru: Скидка
vi: Giảm giá

# editBillInfoSectionToggleDetailsHideTooltip
source: Hide Item Quantity & Unit Price
ru: Скрыть кол-во и цену за ед.
vi: Ẩn Số lượng & Đơn giá

# editBillInfoSectionToggleDetailsShowTooltip
source: Show Item Quantity & Unit Price
ru: Показать кол-во и цену за ед.
vi: Hiển thị Số lượng & Đơn giá

# editBillInfoSectionAddOptionalTooltip
source: Add Tax, Tip, Discount, Currency
ru: Добавить налог, чаевые, скидку, валюту
vi: Thêm Thuế, Tiền boa, Giảm giá, Tiền tệ

# dialogEditWeightTitle
source: Edit Weight Ratio
ru: Редактировать весовое соотношение
vi: Chỉnh tỉ lệ trọng số

# dialogEditWeightInputLabel
source: Enter weight value (minimum is 1):
ru: Введите значение весового соотношения (минимум 1):
vi: Nhập giá trị trọng số (tối thiểu là 1):

# dialogEditWeightInputHint
source: Enter value 1 or higher
ru: Введите значение 1 или выше
vi: Nhập giá trị từ 1 trở lên

# dialogEditWeightValidationError
source: Please enter an integer number 1 or higher
ru: Пожалуйста, введите целое число 1 или выше
vi: Vui lòng nhập một số nguyên từ 1 trở lên

# dialogParticipantsTitle
source: Participants for "{itemName}"
ru: Выберите участников для "{itemName}"
vi: Chọn người chia sẻ cho "{itemName}"

# dialogParticipantsHeaderName
source: Participant
ru: Участник
vi: Người tham gia

# dialogParticipantsHeaderWeight
source: Ratio
ru: Соотношение
vi: Tỉ lệ

# billItemWidgetOptionsTooltip
source: Item options
ru: Опции позиции
vi: Tùy chọn món

# billItemWidgetEditDetails
source: Edit Details
ru: Редактировать детали
vi: Sửa chi tiết

# billItemWidgetSplitByPercentage
source: Split by Percentage
ru: Разделить по процентам
vi: Chia theo phần trăm

# billItemWidgetAppliedPercentageSplit
source: Percentage split applied.
ru: Разделение по процентам применено.
vi: Đã áp dụng chia theo phần trăm.

# splitByPercentageDialogErrorNegativePercentage
source: Percentage for {participantName} cannot be negative.
ru: Процент для {participantName} не может быть отрицательным.
vi: Phần trăm của {participantName} không thể âm.

# splitByPercentageDialogErrorTotalNot100
source: Total percentage must be 100%. Current total: {currentTotal}%.
ru: Общая сумма процентов должна быть 100%. Текущая сумма: {currentTotal}%.
vi: Tổng phần trăm phải là 100%. Tổng hiện tại: {currentTotal}%.

# settingsPageSignOutButton
source: Sign Out
ru: Выйти
vi: Đăng xuất

# settingsPageThemeLabel
source: Theme
ru: Тема
vi: Giao diện

# settingsPageThemeLight
source: Light
ru: Светлая
vi: Sáng

# settingsPageThemeDark
source: Dark
ru: Темная
vi: Tối

# settingsPageThemeSystem
source: System
ru: Системная
vi: Hệ thống

# settingsPageThemeTooltip
source: Toggle theme
ru: Переключить тему
vi: Chuyển đổi giao diện

# appTitle
source: Hyper Split Bill
ru: Гипер Сплит Билл
